/*
    시험 감독
    시간 제한	메모리 제한	제출	정답	맞은 사람	정답 비율
    2 초	512 MB	28613	7072	5110	24.188%

    문제
    총 N개의 시험장이 있고, 각각의 시험장마다 응시자들이 있다. i번 시험장에 있는 응시자의 수는 Ai명이다.

    감독관은 총감독관과 부감독관으로 두 종류가 있다. 
    총감독관은 한 방에서 감시할 수 있는 응시자의 수가 B명이고, 부감독관은 한 방에서 감시할 수 있는 응시자의 수가 C명이다.

    각각의 시험장에 총감독관은 오직 1명만 있어야 하고, 부감독관은 여러 명 있어도 된다.

    각 시험장마다 응시생들을 모두 감시해야 한다. 이때, 필요한 감독관 수의 최솟값을 구하는 프로그램을 작성하시오.

    입력
    첫째 줄에 시험장의 개수 N(1 ≤ N ≤ 1,000,000)이 주어진다.

    둘째 줄에는 각 시험장에 있는 응시자의 수 Ai (1 ≤ Ai ≤ 1,000,000)가 주어진다.

    셋째 줄에는 B와 C가 주어진다. (1 ≤ B, C ≤ 1,000,000)

    출력
    각 시험장마다 응시생을 모두 감독하기 위해 필요한 감독관의 최소 수를 출력한다.

    풀이
    각 시험장에 정감독 한명 배치시켜 감시 가능한 학생수를 제외
    나머지 학생들을 부감독이 감시
    
    시험장의 수 * 각 시험장의 최대 학생 수 = 10^12
    10^12 / 감독이 감시 할 수 있는 최소 학생수 = 10^12
    => int 불가능 
    int = 21 억 // unsigned int = 42억
    8 byte = long long
*/

#include <iostream>
int n, b, c;
int p[1000000];

int main () {
    scanf("%d", &n);
    for (int i = 0; i < n; ++i) {
        scanf("%d", &p[i]);
    }
    scanf("%d %d", &b, &c);

    long long ret = 0;
    for (int i = 0; i < n; ++i) {
        p[i] -= b;
        ++ret;
        if (p[i] > 0) {
            int candi = p[i] / c;
            if (p[i] % c != 0) {
                ++candi;
            }
            ret += candi;
        }
    }
    printf("%lld\n", ret);
    return 0;
}